Revit 2027 API
TransmissionData Constructor
 Constructs a TransmissionData from another TransmissionData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransmissionData(
	TransmissionData other
)
Public Sub New (
	other As TransmissionData
)
public:
TransmissionData(
	TransmissionData^ other
)
new :
        other : TransmissionData -> TransmissionData
Parameters
other TransmissionData
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace